| Readers | Writers |
|---------|---------|
| read_csv | to_csv |
| read_excel  | to_excel | 
| read_hdf | to_hdf | 
| read_sql | to_sql | 
| read_json | to_json | 
| read_html | to_html | 
| read_stata | to_stata | 
| read_clipboard | to_clipboard | 
| read_pickle | to_pickle | 
| read_msgpack | to_msgpack (experimental) | 
| read_gbq | to_gbq (experimental) |

#### Read CSV (comma-separated values) or Txt file
    - tabular data can be separated by spaces or tabs and are typically contained in text files of various types (generally with the .txt extension).
    - read_csv(file_name), read_table, to_csv
    - csv file is with comma delimited. Ex : 12,sga,256,26
 - Without header
   - if csv file is without header then first row will be treated as header
     - to overcome this use "pd.read_csv('ch05_02.csv', header=None)"
     - add names to the header using "names=['white','red','blue','green','animal']" argument
   - "index_col" option, assigning all the columns to be converted into indexes.

In [121]:
import pandas as pd
import numpy as np

CSV_File_Path = './files/csv_ex.csv'

csvframe = pd.read_csv(CSV_File_Path)
# alternatively you can use
pd.read_table(CSV_File_Path,sep=',')

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1                mouse

In [20]:
CSV_WITHOUT_HEADER = './files/csv_without_header.csv'
csvframe = pd.read_csv(CSV_WITHOUT_HEADER, header=None)
print("csv without header\n",csvframe)

csvframe = pd.read_csv(CSV_WITHOUT_HEADER, names=['white','red','blue','green','animal'])
print("csv without header\n",csvframe)

csv without header
    0  1  2  3                    4
0  1  5  2  3    cat
1  2  7  8  5    dog
2  3  3  6  7  horse
3  2  2  8  3   duck
4  4  4  2  1                mouse
csv without header
    white  red  blue  green               animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1                mouse

In [29]:
pd.read_csv(CSV_File_Path, index_col=['blue','red'])

          white  green animal
blue red
2    5        1      3    cat
8    7        2      5    dog
6    3        3      7  horse
8    2        2      3   duck
2    4        4      1                mouse

#### Regexp to Parse TXT Files
    - separators are not well defined with commas or smicolon or spaces
    - specify a regexp within the read_table() function using the sep option
    - Example := spaces and tabs are in unpredictable order
      - use r'\s+' this regexp
      - example : pd.read_table(irregular_space_file, sep=r'\s+', engine='python', header = None)

| Metacharacters | |
| --------------------------|----------|
| . | Single character, except newline |
| \d | Digit | 
| \D | Non-digit character | 
| \s | Whitespace character | 
| \S | Non-whitespace character | 
| \n | New line character | 
| \t | Tab character | 
| \uxxxx | Unicode character specified by the hexadecimal number xxxx | 

- if wants to skip some rows use "skiprows"
  - Ex : "pd.read_table('ch05_06.txt',sep=',',skiprows=[0,1,3,6])"

In [95]:
import re
ser = pd.Series(['ar  f s\t\t34','vah34'])
#ser[0].split(sep='\s+')
re.split(r'\s+',ser[0])

['ar', 'f', 's', '34']

In [96]:
irregular_space_file = './files/irregularspace.txt'
file_actual_data = pd.read_table(irregular_space_file,header = None)
print("file_actual_data = ",file_actual_data)

# another way of parsing
#file_parsed_data = pd.read_table(irregular_space_file,header = None,sep=r'\s+', engine='python')
#print("file_parsed_data = \n",file_parsed_data)

pd.read_table(irregular_space_file, sep=r'\s+', engine='python', header = None)

file_actual_data =                        0
0  svjxs  wuuj       34

       0     1   2
0  svjxs  wuuj  34

In [119]:
Data = '123ads24bhs34'

regex = r'\D+'
#re.split(r'\D+',Data)
re.split(regex,Data)

['123', '24', '34']

#### write Data to CSV
    - to_csv() used to write to csv file
    - if don't want to write header and index then use
      - frame.to_csv('ch05_07b.csv', index=False, header=False) 
    - if there are some NaN values then use
      - frame3.to_csv('ch05_09.csv', na_rep ='NaN')

In [123]:
CSV_WRITE_WITH_HEADER = './files/csv_write_with_header.csv'
frame = pd.DataFrame(np.arange(16).reshape((4,4)),                
               index = ['red', 'blue', 'yellow', 'white'],                
               columns = ['ball', 'pen', 'pencil', 'paper'])

frame.to_csv(CSV_WRITE_WITH_HEADER)

pd.read_csv(CSV_WRITE_WITH_HEADER)

  Unnamed: 0  ball  pen  pencil  paper
0        red     0    1       2      3
1       blue     4    5       6      7
2     yellow     8    9      10     11
3      white    12   13      14     15

In [126]:
# without index
CSV_WRITE_WITHOUT_INDEX = './files/csv_write_without_index.csv'
frame.to_csv(CSV_WRITE_WITHOUT_INDEX, index=False)

pd.read_csv(CSV_WRITE_WITHOUT_INDEX)

   ball  pen  pencil  paper
0     0    1       2      3
1     4    5       6      7
2     8    9      10     11
3    12   13      14     15

In [129]:
CSV_WRITE_NaN = './files/csv_write_NaN.csv'
frame2 = pd.DataFrame([[6,np.nan,np.nan,6,np.nan],                
           [np.nan,np.nan,np.nan,np.nan,np.nan],                
           [np.nan,np.nan,np.nan,np.nan,np.nan],                
           [20,np.nan,np.nan,20.0,np.nan],                
           [19,np.nan,np.nan,19.0,np.nan]                
           ],                
                  index=['blue','green','red','white','yellow'],                
                     columns=['ball','mug','paper','pen','pencil']) 

frame2.to_csv(CSV_WRITE_NaN, na_rep ='Not_Number', index = False)

pd.read_csv(CSV_WRITE_NaN)

         ball         mug       paper         pen      pencil
0         6.0  Not_Number  Not_Number         6.0  Not_Number
1  Not_Number  Not_Number  Not_Number  Not_Number  Not_Number
2  Not_Number  Not_Number  Not_Number  Not_Number  Not_Number
3        20.0  Not_Number  Not_Number        20.0  Not_Number
4        19.0  Not_Number  Not_Number        19.0  Not_Number

#### read write excel file
    - use "pip install openpyxl" to install module for excel
    - then import module using 'import openpyxl'
    - use 'read_excel' and 'to_excel'
    - pd.read_excel(EXCEL_FILE_TO_READ,'Sheet2')            # to read sheet 2
    - To read all sheets as once use : 'sheet_name=None'
      - ex : pd.read_excel(EXCEL_FILE_TO_READ,sheet_name=None)
    - excel_file = pd.ExcelFile(EXCEL_FILE_TO_READ)
    - available_sheets = excel_file.sheet_names             # read name of sheet avaialable
    - Write to  excel using 'to_excel'

In [ ]:
pip install openpyxl

In [135]:
import openpyxl
EXCEL_FILE_TO_READ = './files/excel_to_read.xlsx'
excel_frame = pd.read_excel(EXCEL_FILE_TO_READ)
pd.read_excel(EXCEL_FILE_TO_READ)

  Unnamed: 0  red  white  green  black
0          a   56     43     56     34
1          b   74     75     35     87
2          c   65     26     68     86
3        NaN    2     72     76     43

In [137]:
pd.read_excel(EXCEL_FILE_TO_READ,'Sheet2')

  Unnamed: 0  Yellow  Blue  Orange
0          A      32    54      24
1          B      34    23      65
2          C      54    25      12

In [ ]:
excel_file = pd.ExcelFile(EXCEL_FILE_TO_READ)
available_sheets = excel_file.sheet_names
print("available_sheets = ",available_sheets)

available_sheets =  ['Sheet1', 'Sheet2']

In [140]:
pd.read_excel(EXCEL_FILE_TO_READ,sheet_name=None)

{'Sheet1':   Unnamed: 0  red  white  green  black
 0          a   56     43     56     34
 1          b   74     75     35     87
 2          c   65     26     68     86
 3        NaN    2     72     76     43,
 'Sheet2':   Unnamed: 0  Yellow  Blue  Orange
 0          A      32    54      24
 1          B      34    23      65
 2          C      54    25      12}

In [147]:
CREATE_EXCEL_FILE = './files/excel_write.xlsx'

frame1 = pd.DataFrame(np.random.random((4,4)),              
                      index = ['exp1','exp2','exp3','exp4'],              
                      columns = ['Jan2015','Fab2015','Mar2015','Apr2005'])  
frame2 = pd.DataFrame(np.random.random((4,4)),              
                      index = ['exp5','exp6','exp7','exp8'],              
                      columns = ['Jan2020','Fab2020','Mar2020','Apr2020'])  

with pd.ExcelWriter(CREATE_EXCEL_FILE) as writer:
    frame1.to_excel(writer,sheet_name='test_1')
    frame2.to_excel(writer,sheet_name='test_2')

pd.read_excel(CREATE_EXCEL_FILE,sheet_name=None)

{'test_1':   Unnamed: 0   Jan2015   Fab2015   Mar2015   Apr2005
 0       exp1  0.741094  0.265853  0.918867  0.173804
 1       exp2  0.469058  0.505743  0.375060  0.464324
 2       exp3  0.016881  0.542314  0.863493  0.804713
 3       exp4  0.381928  0.166826  0.426784  0.505983,
 'test_2':   Unnamed: 0   Jan2020   Fab2020   Mar2020   Apr2020
 0       exp5  0.031810  0.612003  0.333285  0.493072
 1       exp6  0.484933  0.444932  0.145269  0.745214
 2       exp7  0.246422  0.772847  0.652311  0.024368
 3       exp8  0.836374  0.320972  0.228540  0.220236}